sterentev/atdf-device-asm-include/inc/AT90USB647.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	OTGTCON		= 0xF9		; [MEMORY MAPPED] 
.equ	UPINT		= 0xF8		; [MEMORY MAPPED] 
.equ	UPBCHX		= 0xF7		; [MEMORY MAPPED] 
.equ	UPBCLX		= 0xF6		; [MEMORY MAPPED] 
.equ	UPERRX		= 0xF5		; [MEMORY MAPPED] 
.equ	UEINT		= 0xF4		; [MEMORY MAPPED] 
.equ	UEBCHX		= 0xF3		; [MEMORY MAPPED] 
.equ	UEBCLX		= 0xF2		; [MEMORY MAPPED] 
.equ	UEDATX		= 0xF1		; [MEMORY MAPPED] 
.equ	UEIENX		= 0xF0		; [MEMORY MAPPED] 
.equ	UESTA1X		= 0xEF		; [MEMORY MAPPED] 
.equ	UESTA0X		= 0xEE		; [MEMORY MAPPED] 
.equ	UECFG1X		= 0xED		; [MEMORY MAPPED] 
.equ	UECFG0X		= 0xEC		; [MEMORY MAPPED] 
.equ	UECONX		= 0xEB		; [MEMORY MAPPED] 
.equ	UERST		= 0xEA		; [MEMORY MAPPED] 
.equ	UENUM		= 0xE9		; [MEMORY MAPPED] 
.equ	UEINTX		= 0xE8		; [MEMORY MAPPED] 
.equ	UDMFN		= 0xE6		; [MEMORY MAPPED] 
.equ	UDFNUM		= 0xE4		; [MEMORY MAPPED] 
.equ	UDADDR		= 0xE3		; [MEMORY MAPPED] 
.equ	UDIEN		= 0xE2		; [MEMORY MAPPED] 
.equ	UDINT		= 0xE1		; [MEMORY MAPPED] 
.equ	UDCON		= 0xE0		; [MEMORY MAPPED] 
.equ	OTGINT		= 0xDF		; [MEMORY MAPPED] 
.equ	OTGIEN		= 0xDE		; [MEMORY MAPPED] 
.equ	OTGCON		= 0xDD		; [MEMORY MAPPED] 
.equ	USBINT		= 0xDA		; [MEMORY MAPPED] 
.equ	USBSTA		= 0xD9		; [MEMORY MAPPED] 
.equ	USBCON		= 0xD8		; [MEMORY MAPPED] USB General Control Register
.equ	UHWCON		= 0xD7		; [MEMORY MAPPED] USB Hardware Configuration Register
.equ	UDR1		= 0xCE		; [MEMORY MAPPED] USART I/O Data Register
.equ	UBRR1		= 0xCC		; [MEMORY MAPPED] USART Baud Rate Register  Bytes
.equ	UCSR1C		= 0xCA		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR1B		= 0xC9		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR1A		= 0xC8		; [MEMORY MAPPED] USART Control and Status Register A
.equ	TWAMR		= 0xBD		; [MEMORY MAPPED] TWI (Slave) Address Mask Register
.equ	TWCR		= 0xBC		; [MEMORY MAPPED] TWI Control Register
.equ	TWDR		= 0xBB		; [MEMORY MAPPED] TWI Data register
.equ	TWAR		= 0xBA		; [MEMORY MAPPED] TWI (Slave) Address register
.equ	TWSR		= 0xB9		; [MEMORY MAPPED] TWI Status Register
.equ	TWBR		= 0xB8		; [MEMORY MAPPED] TWI Bit Rate register
.equ	ASSR		= 0xB6		; [MEMORY MAPPED] Asynchronous Status Register
.equ	OCR2B		= 0xB4		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register B
.equ	OCR2A		= 0xB3		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register A
.equ	TCNT2		= 0xB2		; [MEMORY MAPPED] Timer/Counter2
.equ	TCCR2B		= 0xB1		; [MEMORY MAPPED] Timer/Counter2 Control Register B
.equ	TCCR2A		= 0xB0		; [MEMORY MAPPED] Timer/Counter2 Control Register A
.equ	UPDATX		= 0xAF		; [MEMORY MAPPED] 
.equ	UPIENX		= 0xAE		; [MEMORY MAPPED] 
.equ	UPCFG2X		= 0xAD		; [MEMORY MAPPED] 
.equ	UPSTAX		= 0xAC		; [MEMORY MAPPED] 
.equ	UPCFG1X		= 0xAB		; [MEMORY MAPPED] 
.equ	UPCFG0X		= 0xAA		; [MEMORY MAPPED] 
.equ	UPCONX		= 0xA9		; [MEMORY MAPPED] 
.equ	UPRST		= 0xA8		; [MEMORY MAPPED] 
.equ	UPNUM		= 0xA7		; [MEMORY MAPPED] 
.equ	UPINTX		= 0xA6		; [MEMORY MAPPED] 
.equ	UPINRQX		= 0xA5		; [MEMORY MAPPED] 
.equ	UHFLEN		= 0xA4		; [MEMORY MAPPED] 
.equ	UHFNUM		= 0xA2		; [MEMORY MAPPED] 
.equ	UHADDR		= 0xA1		; [MEMORY MAPPED] 
.equ	UHIEN		= 0xA0		; [MEMORY MAPPED] 
.equ	UHINT		= 0x9F		; [MEMORY MAPPED] 
.equ	UHCON		= 0x9E		; [MEMORY MAPPED] 
.equ	OCR3C		= 0x9C		; [MEMORY MAPPED] Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3B		= 0x9A		; [MEMORY MAPPED] Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3A		= 0x98		; [MEMORY MAPPED] Timer/Counter3 Output Compare Register A  Bytes
.equ	ICR3		= 0x96		; [MEMORY MAPPED] Timer/Counter3 Input Capture Register  Bytes
.equ	TCNT3		= 0x94		; [MEMORY MAPPED] Timer/Counter3  Bytes
.equ	TCCR3C		= 0x92		; [MEMORY MAPPED] Timer/Counter 3 Control Register C
.equ	TCCR3B		= 0x91		; [MEMORY MAPPED] Timer/Counter3 Control Register B
.equ	TCCR3A		= 0x90		; [MEMORY MAPPED] Timer/Counter3 Control Register A
.equ	OCR1C		= 0x8C		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register C  Bytes
.equ	OCR1B		= 0x8A		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register B  Bytes
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register A  Bytes
.equ	ICR1		= 0x86		; [MEMORY MAPPED] Timer/Counter1 Input Capture Register  Bytes
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer/Counter1  Bytes
.equ	TCCR1C		= 0x82		; [MEMORY MAPPED] Timer/Counter 1 Control Register C
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	DIDR1		= 0x7F		; [MEMORY MAPPED] 
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	ADMUX		= 0x7C		; [MEMORY MAPPED] The ADC multiplexer Selection Register
.equ	ADCSRB		= 0x7B		; [MEMORY MAPPED] ADC Control and Status Register B
.equ	ADCSRA		= 0x7A		; [MEMORY MAPPED] The ADC Control and Status register
.equ	ADC		= 0x78		; [MEMORY MAPPED] ADC Data Register  Bytes
.equ	XMCRB		= 0x75		; [MEMORY MAPPED] External Memory Control Register B
.equ	XMCRA		= 0x74		; [MEMORY MAPPED] External Memory Control Register A
.equ	TIMSK3		= 0x71		; [MEMORY MAPPED] Timer/Counter3 Interrupt Mask Register
.equ	TIMSK2		= 0x70		; [MEMORY MAPPED] Timer/Counter Interrupt Mask register
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter1 Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter0 Interrupt Mask Register
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Mask Register 0
.equ	EICRB		= 0x6A		; [MEMORY MAPPED] External Interrupt Control Register B
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register A
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	OSCCAL		= 0x66		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	PRR1		= 0x65		; [MEMORY MAPPED] Power Reduction Register1
.equ	PRR0		= 0x64		; [MEMORY MAPPED] Power Reduction Register0
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] 
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	EIND		= 0x3C		; Extended Indirect Register
.equ	RAMPZ		= 0x3B		; RAM Page Z Select Register
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	OCDR		= 0x31		; On-Chip Debug Related Register in I/O Memory
.equ	ACSR		= 0x30		; Analog Comparator Control And Status Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose IO Register 2
.equ	GPIOR1		= 0x2A		; General Purpose IO Register 1
.equ	PLLCSR		= 0x29		; PLL Status and Control register
.equ	OCR0B		= 0x28		; Timer/Counter0 Output Compare Register
.equ	OCR0A		= 0x27		; Timer/Counter0 Output Compare Register
.equ	TCNT0		= 0x26		; Timer/Counter0
.equ	TCCR0B		= 0x25		; Timer/Counter Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter  Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Address Register Low Bytes
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	TIFR3		= 0x18		; Timer/Counter3 Interrupt Flag register
.equ	TIFR2		= 0x17		; Timer/Counter Interrupt Flag Register
.equ	TIFR1		= 0x16		; Timer/Counter1 Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter0 Interrupt Flag register
.equ	PORTF		= 0x11		; Data Register, Port F
.equ	DDRF		= 0x10		; Data Direction Register, Port F
.equ	PINF		= 0x0F		; Input Pins, Port F
.equ	PORTE		= 0x0E		; Data Register, Port E
.equ	DDRE		= 0x0D		; Data Direction Register, Port E
.equ	PINE		= 0x0C		; Input Pins, Port E
.equ	PORTD		= 0x0B		; Port D Data Register
.equ	DDRD		= 0x0A		; Port D Data Direction Register
.equ	PIND		= 0x09		; Port D Input Pins
.equ	PORTC		= 0x08		; Port C Data Register
.equ	DDRC		= 0x07		; Port C Data Direction Register
.equ	PINC		= 0x06		; Port C Input Pins
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins


; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

